app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos"
---
  def index
    @photos = Photo.all

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @photo = Photo.find(params[:id])

INSERT INTO "photos" ("created_at", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def new
    @user = current_user
    @photo = @user.photos.create

INSERT INTO "photos" ("created_at", "email", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 30 Mar 2014 23:32:57 UTC +00:00], ["email", nil], ["updated_at", Sun, 30 Mar 2014 23:32:57 UTC +00:00]]
---
  def create

    @user = current_user
    @photo = @user.photos.create(params[:photo])

SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "6"]]
UPDATE "photos" SET "image_file_name" = 'B0vklcr.gif', "image_content_type" = 'image/gif', "image_file_size" = 131461, "image_updated_at" = '2014-04-03 00:46:45.089870', "updated_at" = '2014-04-03 00:46:47.073840' WHERE "photos"."id" = 6
---
  def update
    @photo = Photo.find(params[:id])

    respond_to do |format|
      if @photo.update_attributes(params[:photo])

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 1]]
---
  def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy