app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Mon, 31 Mar 2014 22:52:23 UTC +00:00], ["email", "benjaminboxler@gmail.com"], ["name", "Ben Taylor"], ["updated_at", Mon, 31 Mar 2014 22:52:23 UTC +00:00]]
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save